def init_lunwen
  lunwens = []
  lunwens << { year: "2020", seq: 1, title: "试题一 论信息系统项目的成本管理", content: "项目成本管理在项目管理中占非常重要的地位，成本管理是在项目实施过程中，通过对成本进
行管理，是项目实际发生的成本控制在预算范围内。
请以“论信息系统项目的成本管理”为题进行论述。
1、概要叙述你参与管理过的信息系统项目（项目的背景、项目规模、发起单位、目的、项目
内容、组织结构、项目周期、交付的成果等），并说明你在其中承担的工作（项目背景要求本
人真实经历，不得抄袭及杜撰）.
2、请结合你所叙述的信息系统项目，围绕一下要点论述你对信息系统项目成本管理的认识，
并总结你的心得体会
（1）项目成本管理的过程
（2）项目预算的形成过程" }
  lunwens << { year: "2020", seq: 2, title: "试题二 论信息系统项目的采购管理", content: "项目采购管理是从项目团队外部购买或获得为完成项目工作所需的产品、服务或成果的过程。
请以“论信息系统项目的采购管理”为题进行论述:
1.概要叙述你参与管理过的信息系统项目(项目的背景、项目规模、发起单位、目的、项目内
容、组织结构、项目周期、交付的成果等),并说明你在其中承担的工作(项目背景要求本人真
实经历,不得抄袭及杜撰)
2.请结合你所叙述的信息系统项目,围绕以下要点论述你对信息系统项目采购管理的认识,并
总结你的心得体会:
(1)项目采购管理的过程
(2)如果需要进行招投标,请阐述招投标程序" }



end